Revit 2027 API
RibbonItem.ToolTip Property
The description that appears as a ToolTip for the item.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string ToolTip { get; set; }
Public Property ToolTip As String
	Get
	Set
public:
property String^ ToolTip {
	String^ get ();
	void set (String^ value);
}
member ToolTip : string with get, set
Property Value
String
Remarks
The text that is displayed when the mouse pointer moves over the item. SplitButton and RadioButtonGroup cannot display the tooltip set by this method, the SplitButton will always show the current PushButton tooltip, and RadioButtonGroup has no tooltip.
See Also
Reference
RibbonItem Class
Autodesk.Revit.UI Namespace